{
  "backend/main.mo": "Canister storing images with auto-increment IDs, supporting URL or uploaded blobs and queries for single, all, and blob-only listings.",
  "feature_evidence.json": "Feature-to-file mapping manifest documenting implemented UI and functionality with linked components and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend component, hook, and style file.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining OKLCH color theme and dark mode for the frontend.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx with root container.",
  "frontend/src/App.tsx": "Top-level React app stitching together header, footer, gallery, add-image panel, and modal viewer with data loading.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright text and caffeine.ai link with responsive styling.",
  "frontend/src/components/Header.tsx": "Header displaying the logo, title, and subtitle with responsive layout.",
  "frontend/src/features/a11y/focus.ts": "Utility functions for managing focus, including focus trapping and restoring previous focus.",
  "frontend/src/features/gallery/components/AddImagePanel.tsx": "UI panel for adding images via URL or file upload with validation and upload progress handling.",
  "frontend/src/features/gallery/components/GalleryGrid.tsx": "Renders a responsive image grid with keyboard navigation and selectable image cards.",
  "frontend/src/features/gallery/types/galleryTypes.ts": "Defines GalleryImage and converts backend Image objects to include display URLs and timestamps.",
  "frontend/src/features/viewer/components/ImageViewerModal.tsx": "Full-screen image viewer with navigation, zoom, pan, rotation, slideshow, and keyboard controls.",
  "frontend/src/features/viewer/components/MoreOptionsMenu.tsx": "Dropdown menu providing rotation, fit mode toggling, and basic image info display.",
  "frontend/src/features/viewer/components/SlideshowControls.tsx": "Dropdown for selecting slideshow interval durations.",
  "frontend/src/features/viewer/components/ZoomControls.tsx": "UI controls for zooming in, zooming out, and resetting image scale.",
  "frontend/src/features/viewer/hooks/useImageTransforms.ts": "Hook managing image rotation and fit/actual size mode.",
  "frontend/src/features/viewer/hooks/useSlideshow.ts": "Hook controlling slideshow play state and interval settings.",
  "frontend/src/features/viewer/hooks/useViewerKeyboard.ts": "Keyboard handler for viewer navigation, zoom, reset, and close actions with zoom-aware behavior.",
  "frontend/src/features/viewer/hooks/useZoomPan.ts": "Hook providing zoom, wheel zoom, mouse drag panning, and arrow-key panning logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity auth, managing login state, stored identities, and AuthClient creation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching images and adding images via URL or upload using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for theme, focus states, scrollbars, and TV‑friendly UI behavior.",
  "frontend/src/main.tsx": "App entry point that mounts React, wrapping the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and TV-oriented font sizes.",
  "project_state.json": "Project metadata describing requirements, feature list, and progress for an Android/TV image gallery app."
}